Repository: openstack-archive/sahara-plugin-cdh
Catalog: sahara_plugin_cdh/locale/*/LC_MESSAGES/sahara_plugin_cdh.po
Languages: de, id

source: %(problem)s, reason: %(reason)s
de: %(problem)s, Grund: %(reason)s

source: 'cluster' or 'instance' argument missed
de: Argument 'Cluster' oder 'Instanz' fehlt
id: Argumen 'cluster' atau 'instance' tidak terjawab

source: 0 or 1
de: 0 oder 1
id: 0 atau 1

source: API version %(minv)s is required but %(acv)s is in use.
de: API-Version %(minv)s ist erforderlich, aber %(acv)s wird verwendet.
id: Versi API %(minv)s diperlukan tetapi %(acv)s sedang digunakan.

source: Attribute %(attname)s of class %(classname)s is read only.
de: Attribut %(attname)s der Klasse %(classname)s ist schreibgeschützt.
id: Atribut %(attname)s dari kelas %(classname)s hanya baca.

source: Await Cloudera agents
de: Erwarten Cloudera-Agenten
id: Tunggu agen Cloudera

source: Await agents
de: Erwarten Agenten
id: Menunggu agen

source: Await starting Cloudera Manager
de: Warte auf den Cloudera Manager
id: Tunggu mulai Cloudera Manager

source: CDH %s health check
de: CDH %s Gesundheitscheck
id: CDH %s cek kesehatan

source: CDH plugin cannot scale node group with processes which have no master-processes run in cluster
de: Das CDH-Plug-in kann Knotengruppen nicht mit Prozessen skalieren, für die keine Masterprozesse im Cluster ausgeführt werden
id: Plugin CDH tidak dapat menskala node group dengan proses yang tidak memiliki proses master berjalan di cluster

source: CDH plugin cannot scale nodegroup with processes: %(processes)s
de: Das CDH-Plugin kann Knotengruppen nicht mit Prozessen skalieren: %(processes)s
id: Plugin CDH tidak dapat menskala nodegroup dengan proses: %(processes)s

source: CM API attribute error: %s
de: CM-API-Attributfehler:%s

source: CM API error: %s
de: CM-API-Fehler:%s

source: CM API value error: %s
de: CM-API-Wertfehler:%s

source: CM API version not meet requirement: %s
de: CM API-Version erfüllt nicht die Anforderung:%s
id: Versi CM API tidak memenuhi persyaratan: %s

source: Can't get response from Cloudera Manager
de: Kann keine Antwort von Cloudera Manager erhalten
id: Tidak bisa mendapatkan respons dari Cloudera Manager

source: Class %(class1)s does not derive from %(class2)s; cannot update attributes.
de: Die Klasse %(class1)s wird nicht von %(class2)s abgeleitet. Attribute können nicht aktualisiert werden.
id: Kelas %(class1)s tidak berasal dari %(class2)s; tidak dapat memperbarui atribut.

source: Cloudera Manager has responded that service is in the %s state
de: Cloudera Manager hat geantwortet, dass der Dienst sich im Status '%s' befindet
id: Cloudera Manager telah merespons bahwa layanan dalam %s state

source: Cloudera Manager health check
de: Cloudera Manager-Systemdiagnose
id: Pemeriksaan kesehatan Cloudera Manager

source: Cloudera Manager is Active
de: Cloudera Manager ist Aktiv
id: Cloudera Manager aktif

source: Cloudera {base} or higher required to run {type}jobs
de: Cloudera {base} oder höher erforderlich, um {type} Jobs auszuführen
id: Cloudera {base} atau lebih tinggi diperlukan untuk menjalankan {type}jobs

source: Command %(method)s %(path)s failed: %(msg)s
de: Befehl %(method)s %(path)s fehlgeschlagen: %(msg)s

source: Configure OS
de: Konfiguriere das Betriebssystem
id: Konfigurasikan OS

source: Configure Swift
de: Konfiguriere Swift
id: Konfigurasikan Swift

source: Configure instances
de: Konfiguriere Instanzen
id: Konfigurasikan instances

source: Configure rack awareness
de: Rack-Erkennung konfigurieren
id: Konfigurasikan rack awareness

source: Configure services
de: Konfiguriere Dienste
id: Konfigurasikan layanan

source: Create mgmt service
de: Erstelle einen Verwaltungsdienst

source: Create services
de: Erstelle Dienste
id: Buat layanan

source: Decommission nodes
de: Ausschussknoten

source: Delete instances
de: Instanzen löschen

source: Deploy configs
de: Stelle Konfigurationen bereit

source: Either 'version' or 'fullVersion' must be specified
de: Entweder 'version' oder 'fullVersion' muss angegeben werden
id: 'Versi' atau 'fullVersion' harus ditentukan

source: Enable NameNode HA
de: Aktiviere NameNode HA

source: Enable ResourceManager HA
de: Aktiviere ResourceManager HA

source: Finish cluster starting
de: Beenden Sie den Clusterstart
id: Selesai mulai cluster

source: First run cluster
de: Erster Lauf-Cluster
id: Run pertama cluster

source: Get retry max time reached.
de: Maximale Wiederholungszeit erreicht.
id: Coba lagi waktu max tercapai.

source: HDFS_NAMENODE should be enabled in anti_affinity.
de: HDFS_NAMENODE sollte in anti_affinity aktiviert sein.
id: HDFS_NAMENODE harus diaktifkan di anti_affinity.

source: HDFS_SECONDARYNAMENODE should be enabled in anti_affinity.
de: HDFS_SECONDARYNAMENODE sollte in anti_affinity aktiviert werden.
id: HDFS_SECONDARYNAMENODE harus diaktifkan di anti_affinity.

source: IMPALAD must be installed on every HDFS_DATANODE
de: IMPALAD muss auf jedem HDFS_DATANODE installiert werden
id: IMPALAD harus diinstal pada setiap HDFS_DATANODE

source: Install packages
de: Installiere Pakete
id: Instal paket

source: Invalid property %(attname)s for class %(classname)s.
de: Ungültige Eigenschaft %(attname)s für Klasse %(classname)s.
id: Properti %(attname)s tidak valid untuk kelas %(classname)s.

source: Number of datanodes must be not less than dfs_replication.
de: Die Anzahl der Daten muss nicht kleiner als dfs_replication sein.
id: Jumlah datanodes harus tidak kurang dari dfs_replication.

source: OS on image is not supported by CDH plugin
de: OS on image wird vom CDH-Plugin nicht unterstützt
id: OS pada image tidak didukung oleh plugin CDH

source: Prepare cluster
de: Vorbereiten des Clusters
id: Siapkan kluster

source: Process %(process)s is not supported by CDH plugin
de: Process %(process)s wird vom CDH-Plugin nicht unterstützt
id: Process %(process)s tidak didukung oleh plugin CDH

source: Refresh DataNodes
de: Aktualisiere DataNodes

source: Refresh YARNNodes
de: Aktualisiere YARNNodes

source: Restart stale services
de: Abgelaufene Dienste neu starten

source: Start Cloudera Agents
de: Starte Cloudera-Agenten
id: Mulai Agen Cloudera

source: Start Cloudera Manager
de: Starte den Cloudera Manager
id: Mulai Cloudera Manager

source: Start roles: NODEMANAGER, DATANODE
de: Start Rollen: NODEMANAGER, DATANODE
id: Mulai roles: NODEMANAGER, DATANODE

source: The Cloudera Sahara plugin provides the ability to launch the Cloudera distribution of Apache Hadoop (CDH) with Cloudera Manager management console.
de: Das Cloudera Sahara-Plugin bietet die Möglichkeit, die Cloudera-Distribution von Apache Hadoop (CDH) mit der Cloudera Manager Management Console zu starten.
id: Plugin Cloudera Sahara menyediakan kemampuan untuk meluncurkan distribusi Cloudera dari Apache Hadoop (CDH) dengan konsol manajemen Cloudera Manager.

source: The following checks did not pass: %s
de: Die folgenden Überprüfungen wurden nicht bestanden: %s
id: Cek berikut tidak lulus: %s

source: Unable to find config: applicable_target: {target}, name: {name}
de: Konnte nicht gefunden werden: applicable_target: {target}, name: {name}
id: Tidak dapat menemukan konfigurasi: applicable_target: {target}, name: {name}

source: Update configs
de: Aktualisiere die Konfigurationen

source: YARN_RESOURCEMANAGER should be enabled in anti_affinity.
de: YARN_RESOURCEMANAGER sollte in anti_affinity aktiviert sein.
id: YARN_RESOURCEMANAGER harus diaktifkan di anti_affinity.

source: YARN_STANDBYRM should be enabled in anti_affinity.
de: YARN_STANDBYRM sollte in anti_affinity aktiviert sein.
id: YARN_STANDBYRM harus diaktifkan di anti_affinity.

source: at least 1
de: mindestens 1
id: setidaknya 1

source: be odd
de: sei ungerade

source: not less than 3
de: nicht kleiner als 3
id: tidak kurang dari 3
